Tekla Open API Reference for Tekla Structures 2025
Chamfer.Type Property
 The basic shape type of the chamfer.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Chamfer.ChamferTypeEnum Type { get; set; }
Public Property Type As Chamfer.ChamferTypeEnum
	Get
	Set
Property Value
Type: Chamfer.ChamferTypeEnum
See Also
Reference
Chamfer Class
Tekla.Structures.Model Namespace